# ----------------------------------------------------------------
#              PYTHON EXAM-01
#       제출 파일명 : work_0313_이름.py
# ----------------------------------------------------------------
# ----------------------------------------------------------------
# 1. 아래 데이터가 저장된 메모리 주소를 화면에 출력해주세요.
# ----------------------------------------------------------------
print('#1')
msg="Happy New Year"
print(id(msg))
print('')
# ----------------------------------------------------------------
# 2. 아래처럼 출력하는 코드 방식 3가지를 작성하세요.
#    [출력] 11 + 3 = 14 
# ----------------------------------------------------------------
print('#2')
num1 = 11
num2 = 3

print( num1, '+', num2, '=', num1 + num2 )
print( '%d + %d = %d' %(num1, num2, num1 + num2) )
print( f'{num1} + {num2} = {num1 + num2}' )
print('')
# ----------------------------------------------------------------
# 3. print() 함수 1개를 사용해서 아래처럼 4줄로 출력해주세요.
#    [출력]  오늘은
#           행복한
#           금요일
#           입니다.
# ----------------------------------------------------------------
print('#3')
print('오늘은\n행복한\n금요일\n입니다.')
print('')
# ----------------------------------------------------------------
# 4. 숫자 2개를 입력 받은 후 몫과 나머지 값을 출력해주세요.
#    - 연산자를 사용한 몫과 나머지 출력
#    - 내장함수를 사용한 몫과 나머지 출력
# ----------------------------------------------------------------
print('#4')
num1 = int(input('Enter num1: '))
num2 = int(input('Enter num2: '))

print(f'quotient: { num1 // num2 } remainder: { num1 % num2 }')
print('')
# ----------------------------------------------------------------
#5. 아래 조건을 만족하는 코드를 작성하세요.
#   - 지  역 : 대구
#   - 직  업 : 학생
#   - 혈액형 : AB
#   - 키    : 173
#   - 몸무게 : 72
#   - [힌트] 논리연산자, 비교연산자
# ----------------------------------------------------------------
print('#5')
location = input("지역: ")
job = input("직업: ")
blood_type = input("혈액형: ")
height = int(input("키: "))
weight = int(input("몸무게: "))
# [1] 대구에 거주하는 학생만 선택하기 위한 코드를 작성하세요.
print(location == "대구" and job == "학생")

# [2] 키가 170이상이거나 몸무게가 70미만인 사람을 선택하기 위한 코드 작성하세요.
print(height >= 170 or weight < 70)

# [3] "부산광역시, 대구광역시, 인천광역시, 광주광역시, 대전광역시, 울산광역시"에
#     해당하는지 여부를 코드 작성하세요.
city = ["부산", "대구", "인천", "광주", "대전", "울산"]
print(location in city)

print('')

# ----------------------------------------------------------------
# 6. 코드 작성하세요.
# ----------------------------------------------------------------
print('#6')

# [1] 아래 숫자에 입력 받은 수 만큼 거듭제곱 결과를 출력하세요.
data = 7
power = int(input("Enter power: "))
print(data ** power)
# [2] 아래 숫자에 입력 받은 수 만큼 소수점이하 자리수를 설정 후 출력하세요.
avg = 78.17893102
point = int(input("Enter point: "))
print(f'{avg:.{point}f}')
# [3] 아래 숫자에서 최대값, 최소값을 출력하세요. 
#     그리고 부호(음수/양수) 고려하지 않고 가장 큰 값, 작은 값 출력하세요.
n1, n2, n3, n4, n5 = -11, 4, 3, 71, 9
print(f'Max num: {max(n1, n2, n3, n4, n5)}, Min num: {min(n1, n2, n3, n4, n5)}')
print(f'Max abs num: {max(abs(n1), abs(n2), abs(n3), abs(n4), abs(n5))}, Min abs num: {min(abs(n1), abs(n2), abs(n3), abs(n4), abs(n5))}')

print('')
# ----------------------------------------------------------------
# 7. 이미지 파일을 100장 저장합니다.
#    파일이름은 img_001.jpg ~ img_100.jpg 형식이 되도록
#    포맷문자열을 생성해 주세요.
# ----------------------------------------------------------------
print('#7')

print(f'image_{1:0>3}.jpg')      # 최대 이미지 장수 1000장 1.jpg ~ 1000.jpg
print(f'image_{50:0>3}.jpg')
print(f'image_{100:0>3}.jpg')

print('')
# ----------------------------------------------------------------
# 8. 아래 문자열에서 '홀'글자만 출력하세요.
##   - 홀짝홀짝홀짝홀짝
# ----------------------------------------------------------------
print('#8')
string = "홀짝홀짝홀짝홀짝"
print(string[0::2])

print('')
## ----------------------------------------------------------------
## 9.print() 함수를 사용해서 아래처럼 출력 바랍니다.
##     *    
##    ***   
##   *****  
##  ******* 
## *********
##    ***   
##    ***   
## GOOD LUCK
## ------------------------------------------------------------------
print('#9')

print(f'{"*":^9}')
print(f'{"***":^9}')
print(f'{"*****":^9}')
print(f'{"*******":^9}')
print(f'{"*********":^9}')
print(f'{"***":^9}')
print(f'{"***":^9}')
print("Good Luck")

print('')
## ------------------------------------------------------------------
## 10. 아래 문자열에서 조건에 맞는 부분만 출력하세요.
## - "보고서.xlsx", "message.sns" : 확장자만 출력
## - "2020_결과보고서.xlsx" , "2023_사업계획서.ppt"  :  년도만 출력
## ------------------------------------------------------------------
print('#10')

report1 = "보고서.xlsx"
report2 = "message.sns"
report3 = "2020_결과보고서.xlsx"
report4 = "2023_사업계획서.ppt"

print(report1[4:], report2[-3:], report3[0:4], report4[0:4], sep="\n")
