## --------------------------------------------------------
## List Comprehension : [] + for ~ in + if ~ else
## --------------------------------------------------------
## [요청] data1 리스트의 요소 중 데이터가 2의 배수인 요소만
##       다른 리스트 저장하기
## --------------------------------------------------------
data1 = [1, 2, 3, 4, 5, 6, 7, 8, 9]

# [방법1]--------------------------------------------------
data2 = []              ## empty list

for d in data1:
    if d % 2 == 0:
        data2.append(d * 3)

print(f'data2 => {data2}')

# [방법2]--------------------------------------------------
data3 = [ d*3 for d in data1 if d % 2 == 0]  ## for ~ in 뒤에 if가 오는 것이 포인트
print(f'The result using list comprehension is: {data3}')