# -------------------------------------------
# 표준출력함수 - print()
# -------------------------------------------
## 기본 기능 : print( 데이터 )
#            print(데이터1, 데이터2, ...., 데이터n)

print("오늘은", "좋은날")
print("오늘은", 2025, 9, 2, "화요일")

year = 2025
name = "마징가"
print(year, name, "Good", 2025, id(2025))

# -------------------------------------------
# 원하는 형식으로 출력 - print() 서식지정자 사용
# -------------------------------------------
# => 서식지정자 : 어떤 종류의 데이터가 들어가지는 지정하는 문법
#                * 형식 : %문자1개
#                * 종류 : %d, %f, %s, %x (hex)
# -------------------------------------------
a = 10
b = 20
c = 4.
## 출력요청 : a + b = 30
print("a + b = ", a + b)

## 출력요청 : 10 + 20 = 30
print(a, "+", b, "=", a + b)

print("%d + %d = %d" %(a, b, a + b))    ## 훨씬 더 직관적

## 출력요청 : 10 + 20 + 4.0 = 34.0
print("%d + %d + %f = %f" %(a, b, c, a + b + c))

## 자동 형변환 적용
print("%s + %s + %s = %s" %(a, b, c, a + b + c))

# -------------------------------------------
# 원하는 형식으로 출력 - f-string 사용
# -------------------------------------------
# f-string : 문자열 내보에 서식이 지정된 문자열을 의미
#                * 형식 : F'   {변수명}', f'   {데이터}'
#                * 종류 : %d, %f, %s, %x (hex)
# -------------------------------------------
## 10 + 20 + 4.0 = 34.0
print(f'{a} + {b} + {c} = {a + b + c}')

## f-string 변수명 ---------------------------
DATA_DIR = 'Data'
FILE_NAME = 'cat.jpg'

FILE_PATH = f'{DATA_DIR}/{FILE_NAME}'

print(FILE_PATH)