# ------------------------------------------------
# 데이터 타입의 변환 / 형변환 / 타입 캐스팅 / 캐스팅
# ------------------------------------------------
# ?타입 ==> int 타입으로 형변환 : int() 생성자
# ------------------------------------------------
print(f'"3"      => int로 형변환 : { int("3") }')
print(f'3.       => int로 형변환 : { int(3.) }')
print(f'True     => int로 형변환 : { int(True) }')
#print(f'"3."     => int로 형변환 : { int("3.") }')  ## 에러발생, str 타입을 int로 변환하려면 str에 숫자만 들어가야 함
print(f'"-9"     => int로 형변환 : { int("-9") } \n')

# ------------------------------------------------
# ?타입 ==> float 타입으로 형변환 : float() 생성자
# ------------------------------------------------
print(f'-9       => float로 형변환 : { float(-9) }')
print(f'True     => float로 형변환 : { float(True) }')
print(f'3.4      => float로 형변환 : { float("3.4") }\n')

# ------------------------------------------------
# ?타입 ==> bool 타입으로 형변환 : bool() 생성자
#          0과 1
# ------------------------------------------------
# => int 타입 : 0만 False, 나머지 숫자 모두 True
print(f'-9       => bool로 형변환 : { bool(-9) }')
print(f'0        => bool로 형변환 : { bool(0) } \n')

# => float 타입 : 0.0만 False, 나머지 숫자 모두 True
print(f'.7       => bool로 형변환 : { bool(.7) }')
print(f'.0       => bool로 형변환 : { bool(.0) }')
print(f'.1       => bool로 형변환 : { bool(.1) } \n')

# => str 타입 : '',"" 과 같이 empty string만 False, 나머지 숫자 모두 True
print(f'3.4      => bool로 형변환 : { bool("3.4") }')
print(f'"0"      => bool로 형변환 : { bool("0") }') # ★★★★★★★★ string type이므로 true가 된다. 헷갈리지 않도록 주의!
print(f'""       => bool로 형변환 : { bool("") } \n')