## --------------------------------------------------------
## 내부 패키지 활용하기
## --------------------------------------------------------
## [1] 기본 형태 -------------------------------------------
##     __init__.py가 선언되이 않았을 경우
## --------------------------------------------------------
# import calcpkg.geometry as geo
# import calcpkg.operation as op

# ## 패키지 내 모듈 함수들 사용
# print(geo.rectangle_area(10, 4))
# print(op.add(9, 7))

## [2-1] 간략화 형태 -------------------------------------------
##     __init__.py가 [1]로 선언되었을 때 / import를 간단하게 쓸 수 있다.
## --------------------------------------------------------
# import calcpkg                 ## __init__.py 파일을 실행시킴
# ##                             import를 간략하게 쓸 수 있음

# ## 패키지 내 모듈 함수들 사용
# print(calcpkg.geometry.rectangle_area(10, 4))

## [2-2] from ~ import 형태 -------------------------------------------
##     __init__.py가 [1]로 선언되었을 때 / calcpkg를 사용하지 않아도 된다.
## -------------------------------------------------------------------
# from calcpkg import *

# ## 패키지 내 모듈 함수들 사용
# print(geometry.rectangle_area(10, 4))
# print(operation.add(10, 4))

## [3] 패키지 내 모듈들의 모든 것을 import -------------------------------
##     __init__.py가 [2]로 선언되었을 때
## -------------------------------------------------------------------
# from calcpkg import *

# print(rectangle_area(10, 4))
# print(add(10, 4))

## [4] -------------------------------
##     __init__.py가 [3]로 선언되었을 때
## -------------------------------------------------------------------
from calcpkg import *

print(triangle_area(10, 4))
print(add(10, 4))