## --------------------------------------------------------
## List Comprehension : [] + for ~ in + if ~ else
## --------------------------------------------------------
## [요청] data1 리스트의 요소 중 데이터가 2의 배수인 요소는 제곱을
##       하고, 아닌 요소는 3을 곱하기
## --------------------------------------------------------
data1 = [1, 2, 3, 4, 5, 6, 7, 8, 9]

# [방법1]--------------------------------------------------
data2 = []              ## empty list

for d in data1:
    if d % 2 == 0:
        data2.append(d ** 2)
    else:
        data2.append(d * 3)
print(f'data2 => {data2}')

# [방법2]--------------------------------------------------
data3 = [ d ** 2 if d % 2 == 0 else d * 3 for d in data1]  ## ★★★if-else구문이라면, for ~ in 앞으로 오는 것이 포인트
print(f'The result using list comprehension is: {data3}')