## ==========================================================
## Series 인스턴스/객체 생성
## ==========================================================
##-> 모듈 로딩
## ----------------------------------------------------------
import pandas as pd


## ----------------------------------------------------------
##-> 데이터 준비
## ----------------------------------------------------------
jumsu = [[99, 77, 55], 
         [77, 88, 66]]

## ----------------------------------------------------------
##-> DataFrame으로 변환 저장
## ----------------------------------------------------------
dataDF = pd.DataFrame(jumsu)


## ----------------------------------------------------------
##-> List와 Series 데이터 표현/저장 방식 비교
## ----------------------------------------------------------
print('---[LIST 방식]---')
print(jumsu)

print('\n---[Series 방식]---')
print(dataDF)

## ----------------------------------------------------------
##-> Series 인스턴스의 속성 읽기
## ----------------------------------------------------------
print('\n---[Series 속성 읽기]---')
print(f'인덱스: {dataDF.index}')
print(f'컬럼즈: {dataDF.columns}')
print(f'데이터: \n{dataDF.values}, {type(dataDF.values)}')
print(f'형  태: {dataDF.shape}')        ## 1차원으로 원소 수 반환
print(f'차  원: {dataDF.ndim}차원')     ## 1차원
print(f'타  입: \n{dataDF.dtypes}')      ## 여러개이므로 type's'이다. / 컬럼별로 타입이 정해짐