## -------------------------------------------------------------------
## 예외처리(Exception Handling)
## - 개발자가 처리해 줄 수 있는 오류에 대한 부분
## - 발생한 오류에 대한 적절한 대안을 지정
## -------------------------------------------------------------------
## 나눗셈에 발생하는 오류: zero division
## - 데이터: 리스트[10, 20, 30]
## - 나눌값: 입력받기
## -------------------------------------------------------------------
## [형식1] 모든 예외/에러 다 처리해주는 예외처리
## -------------------------------------------------------------------
try:
    data = [10, 20, 30]
    idx, x = map(int, input("인덱스와 나눌 수 입력(예: 0 3): ").split())

    result = data[idx] / x

except:
    print("ERROR 발생")

else:
    print(f'{idx}번 요소를 {x}로 나눈 결과: {result}')

print("---------------------[형식1] 끝-----------------------")
## -------------------------------------------------------------------
## [형식2] 특정에러마다 처리해주는 예외처리
## -------------------------------------------------------------------
try:
    data = [10, 20, 30]
    idx, x = map(int, input("인덱스와 나눌 수 입력(예: 0 3): ").split())

    result = data[idx] / x

except ZeroDivisionError as ze:
    print("cannot be divided by 0.", ze)

except IndexError as ie:
    print("Index out of range.", ie)

except Exception as e:
    ## 위 두개의 에러를 제외한 모든 에러 보여줌
    print(e, "has invoked.")

else:
    print(f'{idx}번 요소를 {x}로 나눈 결과: {result}')