## ----------------------------------------------------------------
## 사용자 정의 함수 : 개발자가 필요에 의해서 만드는 함수
## ----------------------------------------------------------------
## 형식: def 함수이름(파라미터1, ...., 파라미터n):
##          실행코드
## ----------------------------------------------------------------
## 함수기능 : 2개 정수 덧셈 수행 후 결과 출력
## 함수이름 : print_add [파이썬 스타일] / printAdd [일반적인 스타일]
## 매개변수 : num1, num2
## 반환결과 : 덧셈 결과값
## ----------------------------------------------------------------

def print_add_two (num1, num2):
    '''
    :param num1\n
    :param num2\n
    '''
    print(f'{num1} + {num2} = {num1 + num2}')

## ----------------------------------------------------------------
## 함수 사용하기 => 함수 호출
## - 형식 : 함수이름(데이터1, ..., 데이터n)
##          함수이름( )
## ----------------------------------------------------------------
result = print(print_add_two(9, 10))  ## 반환값이 없음 => None

print(f'result => {result}')