## ----------------------------------------------------------------
## 사용자 정의 함수 : 개발자가 필요에 의해서 만드는 함수
## ----------------------------------------------------------------

def plus_three_num (num1, num2, num3):
    result = num1 + num2 + num3
    return result

def plus_six_num (num1, num2, num3, num4, num5, num6):
    result = num1 + num2 + num3 + num4 + num5 + num6
    return result

## ----------------------------------------------------------------
## 어떻게 하면 매개변수 개수 변화에 대응하는 한개의 함수?
## ----------------------------------------------------------------