## ----------------------------------------------------------------
## Dict 자료형 - 전용 메서드(Method)
## ----------------------------------------------------------------
## 요소/원소 읽기 메서드 : get(key, default)
## - default 매개변수 값을 설정하면 Key가 없는 경우
##   default 값을 전달함
## ----------------------------------------------------------------
jumDict = {'과목1': 98, '과목2': 99, '과목3': 100, '과목4': 78, '과목5': 88}

## => 값 가져오기
print(jumDict['과목1'])
# print(jumDict['과목11']) ## KeyERROR

## => get()메서드
print(jumDict.get('과목1'))
print(jumDict.get('과목11', "존재하지 않는 과목"))
print(jumDict.get('과목11', 0))

## ----------------------------------------------------------------
## 요소/원소 꺼내기 메서드 : pop() key와 value를 모두 지움
## - default 매개변수 값을 설정하면 Key가 없는 경우
##   default 값을 전달함
## - dict에서 데이터가 제거됨!!
## ----------------------------------------------------------------
print(jumDict.pop('과목1'))
print(f'jumDict => {jumDict}')

print(jumDict.pop('과목11', "존재하지 않는 과목"))
print(f'jumDict => {jumDict}')

## ----------------------------------------------------------------
## 요소/원소 꺼내기 메서드 : popitem() key와 value를 모두 지움
## dict의 마지막 key value 제거
## ----------------------------------------------------------------
print(f'popitem() => {jumDict.popitem()}')
print(f'jumDict => {jumDict}')

## ----------------------------------------------------------------
## 요소/원소 모두 삭제 메서드 : clear()
## ----------------------------------------------------------------
jumDict.clear()
print(f'jumDict => {jumDict}')