## ----------------------------------------------------------------
## Dict 자료형 - 연산자
## ----------------------------------------------------------------
## 멤버 연산자 in/not in ==> key만 검사함!!
## ----------------------------------------------------------------
jumDict = {'과목1': 98, '과목2': 99, '과목3': 100, '과목4': 78, '과목5': 88}

## 98점이 dict안에 있는지 검사 / value가 들어 있음에도 False 반환
print(f'98 in jumDict => {98 in jumDict}')

## 과목2 dict안에 있는지 검사
print(f'과목2 in jumDict => {"과목2" in jumDict}')

## ----------------------------------------------------------------
## for ~ in ==> key만 검사함!!
## ----------------------------------------------------------------
for jum in jumDict:
    print(jum, jumDict[jum])

## => (key, value) 튜플로
for jum in jumDict.items():
    print(jum)