## =================================================================================
## Python GUI programming - TKinter
## ** Label Widget: 텍스트, 이미지 출력 UI 요소
## =================================================================================
## 모듈 로딩
## =================================================================================
from tkinter import *

## ---------------------------------------------------------------------------------
##- 윈도우 창 생성
## ---------------------------------------------------------------------------------
mainWin = Tk()

mainWin.title("MY APP")
# width * height 그리고 창을 띄울 x y 좌표
mainWin.geometry("1000x200+400+300")
## 창 크기 조절 가능하게 할 지 여부: (WIDTH, HEIGHT)
mainWin.resizable(False, False)

## ---------------------------------------------------------------------------------
##- 윈도우에 배치될 UI 요소들 - Text Lable 요소
## ---------------------------------------------------------------------------------
## 인스턴스 생성
msgLB1 = Label(text="msg Left",
              background='yellow', 
              foreground='red',
              padx=100)

msgLB2 = Label(text="msg Right",
              background='yellow', 
              foreground='red',
              pady=80)

## UI 인스턴스 윈도우에 배치
msgLB1.pack(side="left")
msgLB2.pack(side="right")
## ---------------------------------------------------------------------------------
##- 윈도우에서 발생하는 이벤트 메시지 수신
## ---------------------------------------------------------------------------------
##- 종료 전까지 동작
mainWin.mainloop()