## --------------------------------------------------------
## list 타입 전용 메서드
## --------------------------------------------------------
## 원소/요소 확장 => extend()
## --------------------------------------------------------
## extends(원소) : 원소/요소 합쳐서 새로운 리스트 반환
## --------------------------------------------------------
nums = [11, 22, 33]

nums.extend([9, 8, 7])
print(f'확장 후 {nums}')

nums.extend([9, 8, 7])
print(f'확장 후 {nums}')

print(f'덧셈 진행 {nums + ["A", "B"]}')   # 변경사항이 저장되지는 않음
print(f'덧셈 후 {nums}')

## --------------------------------------------------------
## 원소/요소 삭제 관련 메서드 : remove(), pop(), clear()
## --------------------------------------------------------
## remove(데이터) : 제일 먼저 찾은 데이터 원소/요소 삭제
## --------------------------------------------------------
nums.remove(9)
print(f'"9" 삭제 후 {nums}')

#nums.remove(100)           # ValueError 발생
#print(f'"100" 삭제 후 {nums}')

## --------------------------------------------------------
## pop()/pop(idx) : 인덱스에 해당하는 원소 꺼내기
## --------------------------------------------------------
print(nums.pop())
print(nums.pop())
print(f'pop() 후 => {nums}')

print(nums.pop(2))
print(f'pop() 후 => {nums}')

## --------------------------------------------------------
## clear() : 모든 원소/요소 삭제로 빈 리스트 만듬 
## --------------------------------------------------------
nums.clear()
print(f'clear() 후 => {nums}')