## --------------------------------------------------------
## 숫자 범위를 나타내는 클래스/자료형: range
## - n ~ m 숫자범위
## - 순서있는 (Sequence) 자료형
## --------------------------------------------------------
## => 1 ~ 50 숫자
nums50 = range(1,51)

print(type(nums50), len(nums50), nums50)

## => 1 ~ 50까지 숫자 중에서 2의 배수들
nums2 = range(2, 51, 2)

print(type(nums2), len(nums2), nums2)

## --------------------------------------------------------
## 숫자 범위 인스턴스의 원소/요소 접근: 변수명[인덱스]
## --------------------------------------------------------
print(f'0번 원소 : {nums2[0]}')
print(f'-2번 원소 : {nums2[-2]}')

## --------------------------------------------------------
## 숫자 범위 인스턴스의 원소/요소 접근: 변수명[시작인덱스 : 끝인덱스]
## --------------------------------------------------------
print(f'0번부터 10번까지의 원소 : {nums2[0:11]}')
# => 0번부터 10번까지 원소 : range(2, 24, 2)
