## --------------------------------------------------------
## 순서가 있는 (Sequence) 자료형 - tuple
## 원소/요소 저장 후 읽기만 가능함
## - 원소/요소 변경/삭제/추가 안됨!!!
## - 저장 후 변경이 되면 안되는 데이터 타입
## --------------------------------------------------------
## 튜플 생성 : (데이터1, .., 데이터n)
##            데이터1, ..., 데이터n
##            (데이터,)
##             데이터,
## --------------------------------------------------------
data1 = (10, 30, 50)
data2 = 10, 30
data3 = ('A',)
data4 = 'A',

print(f'data1: {type(data1)}, {len(data1)}개, {data1}')
print(f'data1: {type(data2)}, {len(data2)}개, {data2}')
print(f'data1: {type(data3)}, {len(data3)}개, {data3}')
print(f'data1: {type(data4)}, {len(data4)}개, {data4}')

## --------------------------------------------------------
## 튜플 원소/요소 읽기 : 인덱싱, 슬라이싱
## --------------------------------------------------------
## 원소 1개 읽기 => 변수명[인덱스]
print(f'data1: {data1}, -2번 원소 : {data1[-2]}')

## 원소 2개 읽기 => 변수명[시작: 끝+1: 간격]
print(f'data1: {data1}, 0번, 1번 원소 : {data1[0:2]}')

## --------------------------------------------------------
## 튜플 원소/요소 변경/삭제 : 불가!
## --------------------------------------------------------
# data1[0] = 'A' ## 미지원 기능
# del data1[0]     ## 미지원 기능

## --------------------------------------------------------
## 튜플 원소/요소 추가/제거 메서드 : 미지원
## ==> 지원 메서드 : 원소 갯수 확인 count(value)
##                 원소 인덱스 찾기 index()
## --------------------------------------------------------
print(data1.count(11), data1.index(30))