## ====================================================================
##              Python GUI Programming - TKinter 
## ====================================================================
## Container Layout : Place
##   * Window/화면 상의 절대적 위치에 UI요소 배치
##   * 크기 조정 가능
##   * pack()과 같이 사용될 수 없음. grid()와는 같이 사용할 수 있음
##   * 사용법
##     위젯이름.place(매개변수1, 매개변수2, 매개변수3, ...)
##   * 주요 매개변수
##     x, y, relx, rely : 해당 좌표위치로 위젯 이동
##     width, height, relwidth, relheight : 위젯의 크기 변경
##     anchor : 위젯의 기본 조정 위치를 변경 (기본값 = 왼쪽 상단 모서리)
## ====================================================================

## --------------------------------------------------------------------
## 모듈 로딩 
## --------------------------------------------------------------------
import tkinter

## --------------------------------------------------------------------
##- 윈도우 관련 
## --------------------------------------------------------------------
##- 윈도우 창 인스턴스 생성
window=tkinter.Tk()
window.title("LAYOUT_PACK")
window.geometry("640x400+100+100")
window.resizable(True, True)

## --------------------------------------------------------------------
##- 윈도우에 배치될 UI요소들 - Button 요소
## --------------------------------------------------------------------
##- Button Widget 인스턴스 생성
b1=tkinter.Button(window, text="(50, 50)",   bg='yellow')          #여기서 각 버튼의 부모는 window(TK창)이 된다.
b2=tkinter.Button(window, text="(50, 100)" , bg='yellow')
b3=tkinter.Button(window, text="(100, 150)", bg='yellow')
b4=tkinter.Button(window, text="(0, 200)",   bg='yellow')
b5=tkinter.Button(window, text="(0, 300)",   bg='cyan')
b6=tkinter.Button(window, text="(rx, ry)",   bg='hotpink')

##- Button Widget 인스턴스 화면/Window에 배치 
b1.place(x=50, y=50)
b2.place(x=50, y=100,  width=50, height=50)
b3.place(x=100, y=150, bordermode="inside")     # 테두리의 안밖 여부

b4.place(x=0, y=200, relwidth=0.5)              # 상대너비(부모기준), 윈도우 전체 폭의 50%, 창 크기 변경 시 유동적
b5.place(relx=0.5, y=300)
b6.place(relx=0.5, rely=0.5, anchor='se')       # 버튼의 기본값은 왼쪽 위(nw)를 anchor로 오른쪽 아래(se)로 수정


## --------------------------------------------------------------------
##- 윈도우에서 발생하는 사용자 이벤트 수신
## --------------------------------------------------------------------
##- 종료 전까지 동작
window.mainloop()