## =================================================================================
## Python GUI programming - TKinter
## ** Label Widget: 텍스트, 이미지 출력 UI 요소
## =================================================================================
## 모듈 로딩
## =================================================================================
from tkinter import *
import os
from PIL import Image, ImageTk   # ✅ ImageTk를 반드시 같이 import 해야 함

## ---------------------------------------------------------------------------------
##- 사용자 정의 함수
## ---------------------------------------------------------------------------------
##- 함수 기능: 이미지 데이터에서 TKinter용 이미지 추출 후 변환
##- 함수 이름: get_img
##- 매개변수: imgpath         - 이미지명 포함 경로
##- 반환결과: TKinter용 이미지 데이터
## ---------------------------------------------------------------------------------
photos = []  # 전역 리스트

def get_img(imgpath):
    _, ext = os.path.splitext(imgpath)
    if ext.lower() in ['.png', '.bmp', '.gif', '.ppm', '.pgm']:
        photo = PhotoImage(file=imgpath)
    else:
        img = Image.open(imgpath)
        photo = ImageTk.PhotoImage(img)
    photos.append(photo)
    return photo
    
## ---------------------------------------------------------------------------------
##- 윈도우 창 생성
## ---------------------------------------------------------------------------------
mainWin = Tk()

mainWin.title("MY APP")
# width * height 그리고 창을 띄울 x y 좌표
mainWin.geometry("1000x600+400+300")
## 창 크기 조절 가능하게 할 지 여부: (WIDTH, HEIGHT)
mainWin.resizable(False, False)

## ---------------------------------------------------------------------------------
##- 윈도우에 배치될 UI 요소들 - Image Label 요소
##- 지원 이미지 확장자: png, gif, pgm, ppm
##- 미지원 이미지 경우: 로우 데이터 추출 필요 => conda install pillow
## ---------------------------------------------------------------------------------
IMG_FILE1 = '../image/bell.jpg'
IMG_FILE2 = '../image/dog.jpg'
IMG_FILE3 = '../image/pumpkin.png'



## ---------------------------------------------------------------------------------
##- 이미지 Label 위젯 생성 및 배치
## ---------------------------------------------------------------------------------
imgLB1 = Label(mainWin, image=get_img(IMG_FILE1)) # 이미지 라벨 인스턴스 생성
imgLB2 = Label(mainWin, image=get_img(IMG_FILE2))
imgLB3 = Label(mainWin, image=get_img(IMG_FILE3))

#imgLB1.pack(side="left")
imgLB2.pack(side="left") # UI 인스턴스 윈도우에 배치
imgLB3.pack(side="right")
## ---------------------------------------------------------------------------------
##- 윈도우에서 발생하는 이벤트 메시지 수신
## ---------------------------------------------------------------------------------
mainWin.mainloop()