## =================================================================================
## Python GUI programming - TKinter
## =================================================================================
## 모듈 로딩
## =================================================================================
##-모듈 로딩
from tkinter import *

##- 윈도우 창 생성
mainWin=Tk()

mainWin.title("MY APP")
# width * height 그리고 창을 띄울 x y 좌표
mainWin.geometry("1000x200+400+300")
## 창 크기 조절 가능하게 할 지 여부: (WIDTH, HEIGHT)
mainWin.resizable(False, False)

##- 윈도우에서 발생하는 이벤트 메시지 수신
##- 윈도우 종료될 때까지 실행
mainWin.mainloop()