## =================================================================================
## Python GUI programming - TKinter
## ** Label Widget: 텍스트, 이미지 출력 UI 요소
## =================================================================================
## 모듈 로딩
## =================================================================================
from tkinter import *

## ---------------------------------------------------------------------------------
##- 윈도우 창 생성
## ---------------------------------------------------------------------------------
mainWin = Tk()

mainWin.title("MY APP")
# width * height 그리고 창을 띄울 x y 좌표
mainWin.geometry("1000x200+400+300")
## 창 크기 조절 가능하게 할 지 여부: (WIDTH, HEIGHT)
mainWin.resizable(False, False)

## ---------------------------------------------------------------------------------
##- 윈도우에 배치될 UI 요소들 - Text Lable 요소
## ---------------------------------------------------------------------------------
## 인스턴스 생성
okBTN = Button(mainWin,
        text='ok',
        width=15,
        overrelief="sunken", # 마우스 올렸을 때 버튼 테두리 모양
        repeatdelay=1000, # 눌러진 상태.명령어 실행까지 대기시간
        repeatinterval=100)

## UI 인스턴스 윈도우에 배치
okBTN.pack()
## ---------------------------------------------------------------------------------
##- 윈도우에서 발생하는 이벤트 메시지 수신
## ---------------------------------------------------------------------------------
##- 종료 전까지 동작
mainWin.mainloop()