## ----------------------------------------------------------------
## 사용자 정의 함수 : 개발자가 필요에 의해서 만드는 함수
## ----------------------------------------------------------------
## 형식: def 함수이름(파라미터1, ...., 파라미터n):
##          실행코드
##           ....
##           return 결과
## ----------------------------------------------------------------
## 함수기능 : 2개 정수 덧셈 수행
## 함수이름 : plus_two_num [파이썬 스타일] / plusTwoNum [일반적인 스타일]
## 매개변수 : num1, num2
## 반환결과 : 덧셈 결과값
## ----------------------------------------------------------------

def plus_two_num (num1, num2):
    '''
    2개 정수 덧셈 수행 후 덧셈 수행 후 반환.

    Keyword arguments:
    num1 -- 정수
    num2 -- 정수
    '''
    result = num1 + num2

    return result

## ----------------------------------------------------------------
## 함수 사용하기 => 함수 호출
## - 형식 : 함수이름(데이터1, ..., 데이터n)
##          함수이름( )
## ----------------------------------------------------------------
result = print(plus_two_num(9, 10))

print(f'result => {result}')