## ====================================================================
##              Python GUI Programming - TKinter 
## ====================================================================
## 동일 간격 Grid 설정
## - 프레임/윈도우(그리드의 부모)에서 제공 메서드
##   * 행과 열 설정
##   * grid_rowconfigure() / grid_columnconfigure()
##      -> 매개변수
##          weight: 남는 가로/세로 공간 분배 비율 0 (기본, 안늘어남), 1, 2, .. (크면 더 많이 가져감)
##          minsize: 해당 행/열의 최소 높이(px)   픽셀값(예: 80)
##          uniform: 같은 키를 가진 행들의 높이를 동일하게 문자열 키(예: "row")
##                   같은 키끼리 동일 높이로 강제
## ====================================================================

## --------------------------------------------------------------------
## 모듈 로딩 
## --------------------------------------------------------------------
import tkinter

## --------------------------------------------------------------------
##- 윈도우 관련 
## --------------------------------------------------------------------
##- 윈도우 창 인스턴스 생성
window = tkinter.Tk()
window.title("** Equal Grid **")
window.geometry("900x400")

##- 전역변수
ROWS = 3
COLS = 3
COLORS = ('yellow', 'lightblue', 'pink')
WEIGHT = (1, 2, 3)
## --------------------------------------------------------------------
##- 윈도우에 배치될 행과 열 설정
## --------------------------------------------------------------------

# 가로 3등분
for r in range(ROWS):
    #window.grid_rowconfigure(r, weight=1, uniform="row")          # 균등 부여
    window.grid_rowconfigure(r, weight=WEIGHT[r], uniform="row")   # 행별로 다른값 부여
# 세로 3등분
for c in range(COLS):
    window.grid_columnconfigure(c, weight=1, uniform="col")


## 셀 채우기: sticky="nsew" 중요
for r in range(ROWS):
    f = tkinter.Label(window, bg=COLORS[r], text=f'cell_{r}')

    #- 컬럼병합(columnspan)으로 1행에 1개 Label 배치
    #- 행 크기만큼 widget 늘여서 채우기: sticky="nsew"
    #- 행과 행 사이 여백 공간 설정     : pady, padx
    f.grid(row=r, column=0, columnspan=2, sticky="nsew", padx=2, pady=2)

## --------------------------------------------------------------------
##- 윈도우에서 발생하는 사용자 이벤트 수신
## --------------------------------------------------------------------
##- 종료 전까지 동작
window.mainloop()