## ====================================================================
##              Python GUI Programming - TKinter 
## ====================================================================
## 키 이벤트 처리
## - 이벤트 소스(Widget들) -- 이벤트 처리함수 즉, 핸들러/리스너 : 연결(Bind)
## - 이벤트 종류/타입
##  * <Return>               : Enter 키 눌렀을 때
##  * <Pause>                : Pause 키 눌렀을 때
##  * <Delete>               : Delete 키 눌렀을 때 
## ====================================================================

## --------------------------------------------------------------------
## 모듈 로딩 
## --------------------------------------------------------------------
from tkinter import *

## --------------------------------------------------------------------
##- 윈도우 관련 
## --------------------------------------------------------------------
window = Tk()
window.title("➕KEY Event➕")
window.geometry("400x300")
window.resizable(False, False)

## --------------------------------------------------------------------
##- 윈도우에서 발생하는 사용자 이벤트 처리 핸들러/함수
## --------------------------------------------------------------------
##- 함수기능: Enter 키 이벤트 처리 함수
##- 함수이름: enterKey
##- 매개변수: event
##- 반환결과: 없음
##-          Entry 위젯에 입력된 데이터 출력
## --------------------------------------------------------------------
def enterKey(event):
    print(f'{event}')
    # 현재 입력된 내용 가져오기
    msg = msgENT.get()
    print(f'입력 메시지: {msg}')
    # 입력된 내용 지우기
    msgENT.delete(0, 'insert')          #- 'insert': 현재 커서 위치
## --------------------------------------------------------------------
##- UI 위젯 생성 및 설정
## --------------------------------------------------------------------
##- 메시지 입력 위젯 추가
msgENT = Entry(window)                   #- 인스턴스 생성
msgENT.pack(side="left")                 #- 상단/왼쪽 배치
msgENT.focus()                           #- 마우스 커서가 바로 깜빡이도록 집중시킴


## --------------------------------------------------------------------
##- 이벤트와 이벤트 핸들러 등록/설정 => bind()
## --------------------------------------------------------------------
##- 엔트리 위젯에 핸들러 등록
msgENT.bind("<Return>", enterKey)

## --------------------------------------------------------------------
##- 윈도우에서 발생하는 사용자 이벤트 수신
## --------------------------------------------------------------------
window.mainloop()
