## ----------------------------------------------------------------
## Dict 자료형 살펴보기
## ----------------------------------------------------------------
## dict 객체 생성
## ----------------------------------------------------------------
d1 = { }
d2 = {'name' : '홍길동', 'age':10 }
d3 = {'jumsu':[90, 99, 100], 'rank':10}
d4 = {'jumsu': {'국어': 90, '수학':99, '미술': 100}, 'score': (90, 100)}

## => Key : 변경(수정/삭제) X => list 불가!
d5 = { ('유진', '남'): 90, ('유진', '여'): 90 }

print(f'{type(d1)}, {len(d1)}개, {d1}')
print(f'{type(d2)}, {len(d2)}개, {d2}')
print(f'{type(d3)}, {len(d3)}개, {d3}')
print(f'{type(d4)}, {len(d4)}개, {d4}')
print(f'{type(d5)}, {len(d5)}개, {d5}')

## ----------------------------------------------------------------
## dict의 원소/요소 읽기 => 객체변수명 [Key]
## ----------------------------------------------------------------

## [d2의 age 값 읽기]
print(f'age => {d2["age"]}')

## [d3의 jumsu값 읽기]
print(f'jumsu => {d3["jumsu"]}')

## [d5의 (유진, 여)값 읽기], key가 묶여있다고 해서 일부분만 사용할 수 없다.
print(f'(유진, 여) => {d5[("유진", "여")]}')