## -------------------------------------------------------------------
## set 자료형 전용 메서드
## - add()              : 1개 원소 추가
## - update(iterator)   : 여러 개 원소 추가
## - remove()           : 원소 삭제
## -------------------------------------------------------------------
## s1 = {}  <-- 이건 dict 이므로 주의
s1 = set([1, 1, 3, 5, 7, 7])  ## 빈 집합 생성

print(f's1 => {type(s1)}, {len(s1)}개, {s1}')

## => 원소 추가
s1.add(100)
s1.add("Happy")
s1.add(5)
print(f's1 => {type(s1)}, {len(s1)}개, {s1}')

## => 여러 개 추가
s1.update([1, 9, 9, 'B'])
print(f's1 => {type(s1)}, {len(s1)}개, {s1}')

s1.update("ABCDEF")                             ## 문자가 각각 따로 들어감
print(f's1 => {type(s1)}, {len(s1)}개, {s1}')

## => 삭제
if 'A' in s1:               ## 멤버 연산자 in
    s1.remove("A")
print(f's1 => {type(s1)}, {len(s1)}개, {s1}')

## 중복 제거 ==================================
nums = [1, 2, 1, 2, 1, 2, 1, 7, 9]
nums = list(set(nums))

print(nums)