
## --------------------------------------------------------
## 조건문
## --------------------------------------------------------
## 문제8) 주민번호를 입력 받아서 아래 내용대로 출력해주세요.
## 0000년 0월 0일 생  00세
## (예시: 2000년 8월 2일 생 24세 )
## --------------------------------------------------------
#jumin = input("주민번호 입력(예: 000000-0000000): ").strip()
jumin = '011209-3000000'
## 000000-0000000     G - 1,3,5,7(남)     2,4,6,8(여)    
## YYMMDD-G------
## G => 1, 2면 19--년도 / 3, 4면 20--년도

year = ''
# if jumin[7] == '1' or jumin[7] == '2' or jumin[7] == '5' or jumin[7] == '6':
#     year = int("19"+jumin[:2])

# elif jumin[7] == '3' or jumin[7] == '4' or jumin[7] == '7' or jumin[7] == '8':
#     year = int("20"+jumin[:2])
# if jumin[7] in ['1', '2', '5', '6']:
#     year = int("19"+jumin[:2])
# elif jumin[7] in ['3', '4', '7', '8']:
#     year = int("20"+jumin[:2])

if jumin[7] in '1256':
    year = int("19"+jumin[:2])
elif jumin[7] in '3478':
    year = int("20"+jumin[:2])


age = 2025 - year - 1

print(f'{year}년 {jumin[2:4]}월 {jumin[4:6]}일 {age}세')