## ----------------------------------------------------------------
## 매개변수/파라미터/parameter : 함수 기능 수행에 필요한 데이터
##
## - 종류 : 일반 매개변수       예: value          <= 데이터 미전달 ERROR
##         가변인자 매개변수       *value
##         키워드 매개변수         **value
##         디폴트 매개변수         value=기본값
## ----------------------------------------------------------------
## => 편하게 함수호출 할 수 있도록 문법 제공! 디폴트/기본값 매개변수
## ----------------------------------------------------------------
## 함수 기능: 회원가입 후 가입 메시지 출력
## 함수 이름 : join
## 매개 변수 : id, pw, emailm
##            gender, loc
##            **options
## 반환 결과 : 없음
## ----------------------------------------------------------------
def join(id,pw, email, gender='남', loc='한국', **options):                ## '**' : key=value / 순서 유의
    return
## ----------------------------------------------------------------
## 함수 호출
## ----------------------------------------------------------------
#print(join('AAA', 'A123'))  ## 필수 전달 email 없어서 ERROR
print(join('AAA', 'A123', 'A@naver.com'))
print(join('AAA', 'A123', 'A@naver.com', 취미1='등산', 취미2='게임'))